/*
 Navicat Premium Data Transfer

 Source Server         : MYSQL
 Source Server Type    : MySQL
 Source Server Version : 50716
 Source Host           : localhost:3306
 Source Schema         : bh_wms

 Target Server Type    : MySQL
 Target Server Version : 50716
 File Encoding         : 65001

 Date: 18/09/2022 21:59:11
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for carrier
-- ----------------------------
DROP TABLE IF EXISTS `carrier`;
CREATE TABLE `carrier` (
  `CARRIER_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '承运商ID,主键自增',
  `CARRIER_NAME` varchar(100) NOT NULL COMMENT '承运商名称',
  `CARRIER_LEADER` varchar(100) NOT NULL COMMENT '承运商负责人',
  `CARRIER_TEL` varchar(100) NOT NULL COMMENT '联系电话',
  `CARRIER_EMAIL` varchar(100) DEFAULT NULL COMMENT '联系邮箱',
  `CARRIER_ADDRESS` varchar(255) DEFAULT NULL COMMENT '联系地址',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`CARRIER_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=101 DEFAULT CHARSET=utf8 COMMENT='承运商表';

-- ----------------------------
-- Records of carrier
-- ----------------------------
BEGIN;
INSERT INTO `carrier` VALUES (1, '承运商名称0', '承运商负责人0', '承运商联系电话0', '承运商邮箱0@163.com', '承运商地址0', '2022-09-18 16:46:17', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (2, '承运商名称1', '承运商负责人1', '承运商联系电话1', '承运商邮箱1@163.com', '承运商地址1', '2022-09-18 16:46:17', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (3, '承运商名称2', '承运商负责人2', '承运商联系电话2', '承运商邮箱2@163.com', '承运商地址2', '2022-09-18 16:46:17', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (4, '承运商名称3', '承运商负责人3', '承运商联系电话3', '承运商邮箱3@163.com', '承运商地址3', '2022-09-18 16:46:17', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (5, '承运商名称4', '承运商负责人4', '承运商联系电话4', '承运商邮箱4@163.com', '承运商地址4', '2022-09-18 16:46:17', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (6, '承运商名称5', '承运商负责人5', '承运商联系电话5', '承运商邮箱5@163.com', '承运商地址5', '2022-09-18 16:46:17', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (7, '承运商名称6', '承运商负责人6', '承运商联系电话6', '承运商邮箱6@163.com', '承运商地址6', '2022-09-18 16:46:17', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (8, '承运商名称7', '承运商负责人7', '承运商联系电话7', '承运商邮箱7@163.com', '承运商地址7', '2022-09-18 16:46:17', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (9, '承运商名称8', '承运商负责人8', '承运商联系电话8', '承运商邮箱8@163.com', '承运商地址8', '2022-09-18 16:46:17', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (10, '承运商名称9', '承运商负责人9', '承运商联系电话9', '承运商邮箱9@163.com', '承运商地址9', '2022-09-18 16:46:17', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (11, '承运商名称10', '承运商负责人10', '承运商联系电话10', '承运商邮箱10@163.com', '承运商地址10', '2022-09-18 16:46:17', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (12, '承运商名称11', '承运商负责人11', '承运商联系电话11', '承运商邮箱11@163.com', '承运商地址11', '2022-09-18 16:46:17', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (13, '承运商名称12', '承运商负责人12', '承运商联系电话12', '承运商邮箱12@163.com', '承运商地址12', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (14, '承运商名称13', '承运商负责人13', '承运商联系电话13', '承运商邮箱13@163.com', '承运商地址13', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (15, '承运商名称14', '承运商负责人14', '承运商联系电话14', '承运商邮箱14@163.com', '承运商地址14', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (16, '承运商名称15', '承运商负责人15', '承运商联系电话15', '承运商邮箱15@163.com', '承运商地址15', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (17, '承运商名称16', '承运商负责人16', '承运商联系电话16', '承运商邮箱16@163.com', '承运商地址16', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (18, '承运商名称17', '承运商负责人17', '承运商联系电话17', '承运商邮箱17@163.com', '承运商地址17', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (19, '承运商名称18', '承运商负责人18', '承运商联系电话18', '承运商邮箱18@163.com', '承运商地址18', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (20, '承运商名称19', '承运商负责人19', '承运商联系电话19', '承运商邮箱19@163.com', '承运商地址19', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (21, '承运商名称20', '承运商负责人20', '承运商联系电话20', '承运商邮箱20@163.com', '承运商地址20', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (22, '承运商名称21', '承运商负责人21', '承运商联系电话21', '承运商邮箱21@163.com', '承运商地址21', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (23, '承运商名称22', '承运商负责人22', '承运商联系电话22', '承运商邮箱22@163.com', '承运商地址22', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (24, '承运商名称23', '承运商负责人23', '承运商联系电话23', '承运商邮箱23@163.com', '承运商地址23', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (25, '承运商名称24', '承运商负责人24', '承运商联系电话24', '承运商邮箱24@163.com', '承运商地址24', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (26, '承运商名称25', '承运商负责人25', '承运商联系电话25', '承运商邮箱25@163.com', '承运商地址25', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (27, '承运商名称26', '承运商负责人26', '承运商联系电话26', '承运商邮箱26@163.com', '承运商地址26', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (28, '承运商名称27', '承运商负责人27', '承运商联系电话27', '承运商邮箱27@163.com', '承运商地址27', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (29, '承运商名称28', '承运商负责人28', '承运商联系电话28', '承运商邮箱28@163.com', '承运商地址28', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (30, '承运商名称29', '承运商负责人29', '承运商联系电话29', '承运商邮箱29@163.com', '承运商地址29', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (31, '承运商名称30', '承运商负责人30', '承运商联系电话30', '承运商邮箱30@163.com', '承运商地址30', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (32, '承运商名称31', '承运商负责人31', '承运商联系电话31', '承运商邮箱31@163.com', '承运商地址31', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (33, '承运商名称32', '承运商负责人32', '承运商联系电话32', '承运商邮箱32@163.com', '承运商地址32', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (34, '承运商名称33', '承运商负责人33', '承运商联系电话33', '承运商邮箱33@163.com', '承运商地址33', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (35, '承运商名称34', '承运商负责人34', '承运商联系电话34', '承运商邮箱34@163.com', '承运商地址34', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (36, '承运商名称35', '承运商负责人35', '承运商联系电话35', '承运商邮箱35@163.com', '承运商地址35', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (37, '承运商名称36', '承运商负责人36', '承运商联系电话36', '承运商邮箱36@163.com', '承运商地址36', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (38, '承运商名称37', '承运商负责人37', '承运商联系电话37', '承运商邮箱37@163.com', '承运商地址37', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (39, '承运商名称38', '承运商负责人38', '承运商联系电话38', '承运商邮箱38@163.com', '承运商地址38', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (40, '承运商名称39', '承运商负责人39', '承运商联系电话39', '承运商邮箱39@163.com', '承运商地址39', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (41, '承运商名称40', '承运商负责人40', '承运商联系电话40', '承运商邮箱40@163.com', '承运商地址40', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (42, '承运商名称41', '承运商负责人41', '承运商联系电话41', '承运商邮箱41@163.com', '承运商地址41', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (43, '承运商名称42', '承运商负责人42', '承运商联系电话42', '承运商邮箱42@163.com', '承运商地址42', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (44, '承运商名称43', '承运商负责人43', '承运商联系电话43', '承运商邮箱43@163.com', '承运商地址43', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (45, '承运商名称44', '承运商负责人44', '承运商联系电话44', '承运商邮箱44@163.com', '承运商地址44', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (46, '承运商名称45', '承运商负责人45', '承运商联系电话45', '承运商邮箱45@163.com', '承运商地址45', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 0);
INSERT INTO `carrier` VALUES (47, '承运商名称46', '承运商负责人46', '承运商联系电话46', '承运商邮箱46@163.com', '承运商地址46', '2022-09-18 16:46:18', '2022-09-18 16:46:17', 1);
INSERT INTO `carrier` VALUES (48, '承运商名称47', '承运商负责人47', '承运商联系电话47', '承运商邮箱47@163.com', '承运商地址47', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (49, '承运商名称48', '承运商负责人48', '承运商联系电话48', '承运商邮箱48@163.com', '承运商地址48', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (50, '承运商名称49', '承运商负责人49', '承运商联系电话49', '承运商邮箱49@163.com', '承运商地址49', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (51, '承运商名称50', '承运商负责人50', '承运商联系电话50', '承运商邮箱50@163.com', '承运商地址50', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (52, '承运商名称51', '承运商负责人51', '承运商联系电话51', '承运商邮箱51@163.com', '承运商地址51', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (53, '承运商名称52', '承运商负责人52', '承运商联系电话52', '承运商邮箱52@163.com', '承运商地址52', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (54, '承运商名称53', '承运商负责人53', '承运商联系电话53', '承运商邮箱53@163.com', '承运商地址53', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (55, '承运商名称54', '承运商负责人54', '承运商联系电话54', '承运商邮箱54@163.com', '承运商地址54', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (56, '承运商名称55', '承运商负责人55', '承运商联系电话55', '承运商邮箱55@163.com', '承运商地址55', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (57, '承运商名称56', '承运商负责人56', '承运商联系电话56', '承运商邮箱56@163.com', '承运商地址56', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (58, '承运商名称57', '承运商负责人57', '承运商联系电话57', '承运商邮箱57@163.com', '承运商地址57', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (59, '承运商名称58', '承运商负责人58', '承运商联系电话58', '承运商邮箱58@163.com', '承运商地址58', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (60, '承运商名称59', '承运商负责人59', '承运商联系电话59', '承运商邮箱59@163.com', '承运商地址59', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (61, '承运商名称60', '承运商负责人60', '承运商联系电话60', '承运商邮箱60@163.com', '承运商地址60', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (62, '承运商名称61', '承运商负责人61', '承运商联系电话61', '承运商邮箱61@163.com', '承运商地址61', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (63, '承运商名称62', '承运商负责人62', '承运商联系电话62', '承运商邮箱62@163.com', '承运商地址62', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (64, '承运商名称63', '承运商负责人63', '承运商联系电话63', '承运商邮箱63@163.com', '承运商地址63', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (65, '承运商名称64', '承运商负责人64', '承运商联系电话64', '承运商邮箱64@163.com', '承运商地址64', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (66, '承运商名称65', '承运商负责人65', '承运商联系电话65', '承运商邮箱65@163.com', '承运商地址65', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (67, '承运商名称66', '承运商负责人66', '承运商联系电话66', '承运商邮箱66@163.com', '承运商地址66', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (68, '承运商名称67', '承运商负责人67', '承运商联系电话67', '承运商邮箱67@163.com', '承运商地址67', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (69, '承运商名称68', '承运商负责人68', '承运商联系电话68', '承运商邮箱68@163.com', '承运商地址68', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (70, '承运商名称69', '承运商负责人69', '承运商联系电话69', '承运商邮箱69@163.com', '承运商地址69', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (71, '承运商名称70', '承运商负责人70', '承运商联系电话70', '承运商邮箱70@163.com', '承运商地址70', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (72, '承运商名称71', '承运商负责人71', '承运商联系电话71', '承运商邮箱71@163.com', '承运商地址71', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (73, '承运商名称72', '承运商负责人72', '承运商联系电话72', '承运商邮箱72@163.com', '承运商地址72', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (74, '承运商名称73', '承运商负责人73', '承运商联系电话73', '承运商邮箱73@163.com', '承运商地址73', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (75, '承运商名称74', '承运商负责人74', '承运商联系电话74', '承运商邮箱74@163.com', '承运商地址74', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (76, '承运商名称75', '承运商负责人75', '承运商联系电话75', '承运商邮箱75@163.com', '承运商地址75', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (77, '承运商名称76', '承运商负责人76', '承运商联系电话76', '承运商邮箱76@163.com', '承运商地址76', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (78, '承运商名称77', '承运商负责人77', '承运商联系电话77', '承运商邮箱77@163.com', '承运商地址77', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (79, '承运商名称78', '承运商负责人78', '承运商联系电话78', '承运商邮箱78@163.com', '承运商地址78', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (80, '承运商名称79', '承运商负责人79', '承运商联系电话79', '承运商邮箱79@163.com', '承运商地址79', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (81, '承运商名称80', '承运商负责人80', '承运商联系电话80', '承运商邮箱80@163.com', '承运商地址80', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (82, '承运商名称81', '承运商负责人81', '承运商联系电话81', '承运商邮箱81@163.com', '承运商地址81', '2022-09-18 16:46:18', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (83, '承运商名称82', '承运商负责人82', '承运商联系电话82', '承运商邮箱82@163.com', '承运商地址82', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (84, '承运商名称83', '承运商负责人83', '承运商联系电话83', '承运商邮箱83@163.com', '承运商地址83', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (85, '承运商名称84', '承运商负责人84', '承运商联系电话84', '承运商邮箱84@163.com', '承运商地址84', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (86, '承运商名称85', '承运商负责人85', '承运商联系电话85', '承运商邮箱85@163.com', '承运商地址85', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (87, '承运商名称86', '承运商负责人86', '承运商联系电话86', '承运商邮箱86@163.com', '承运商地址86', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (88, '承运商名称87', '承运商负责人87', '承运商联系电话87', '承运商邮箱87@163.com', '承运商地址87', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (89, '承运商名称88', '承运商负责人88', '承运商联系电话88', '承运商邮箱88@163.com', '承运商地址88', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (90, '承运商名称89', '承运商负责人89', '承运商联系电话89', '承运商邮箱89@163.com', '承运商地址89', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (91, '承运商名称90', '承运商负责人90', '承运商联系电话90', '承运商邮箱90@163.com', '承运商地址90', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (92, '承运商名称91', '承运商负责人91', '承运商联系电话91', '承运商邮箱91@163.com', '承运商地址91', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (93, '承运商名称92', '承运商负责人92', '承运商联系电话92', '承运商邮箱92@163.com', '承运商地址92', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (94, '承运商名称93', '承运商负责人93', '承运商联系电话93', '承运商邮箱93@163.com', '承运商地址93', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (95, '承运商名称94', '承运商负责人94', '承运商联系电话94', '承运商邮箱94@163.com', '承运商地址94', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (96, '承运商名称95', '承运商负责人95', '承运商联系电话95', '承运商邮箱95@163.com', '承运商地址95', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (97, '承运商名称96', '承运商负责人96', '承运商联系电话96', '承运商邮箱96@163.com', '承运商地址96', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (98, '承运商名称97', '承运商负责人97', '承运商联系电话97', '承运商邮箱97@163.com', '承运商地址97', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 0);
INSERT INTO `carrier` VALUES (99, '承运商名称98', '承运商负责人98', '承运商联系电话98', '承运商邮箱98@163.com', '承运商地址98', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 1);
INSERT INTO `carrier` VALUES (100, '承运商名称99', '承运商负责人99', '承运商联系电话99', '承运商邮箱99@163.com', '承运商地址99', '2022-09-18 16:46:19', '2022-09-18 16:46:18', 0);
COMMIT;

-- ----------------------------
-- Table structure for category
-- ----------------------------
DROP TABLE IF EXISTS `category`;
CREATE TABLE `category` (
  `CATEGORY_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '类目ID,主键自增',
  `CATEGORY_NAME` varchar(100) NOT NULL COMMENT '类目名称',
  `LEVEL` int(11) DEFAULT '1' COMMENT '层级',
  `PARENT_ID` int(11) DEFAULT '0' COMMENT '父ID,关联主键(自关联),顶层父ID为0',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`CATEGORY_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COMMENT='商品类目表';

-- ----------------------------
-- Records of category
-- ----------------------------
BEGIN;
INSERT INTO `category` VALUES (1, '一级类目标题1', 1, 0, '2022-09-17 23:09:12', '2022-09-17 23:09:12', 1);
INSERT INTO `category` VALUES (2, '一级类目标题2', 1, 0, '2022-09-17 23:09:12', '2022-09-17 23:09:12', 1);
INSERT INTO `category` VALUES (3, '一级类目标题3', 1, 0, '2022-09-17 23:09:12', '2022-09-17 23:09:12', 1);
INSERT INTO `category` VALUES (4, '一级类目标题4', 1, 0, '2022-09-17 23:09:12', '2022-09-17 23:09:12', 1);
INSERT INTO `category` VALUES (5, '一级类目标题5', 1, 0, '2022-09-17 23:09:12', '2022-09-17 23:09:12', 1);
INSERT INTO `category` VALUES (6, '二级类目标题1', 2, 1, '2022-09-17 23:11:05', '2022-09-17 23:11:05', 1);
INSERT INTO `category` VALUES (7, '二级类目标题2', 2, 1, '2022-09-17 23:11:05', '2022-09-17 23:11:05', 1);
INSERT INTO `category` VALUES (8, '二级类目标题1', 2, 2, '2022-09-17 23:11:05', '2022-09-17 23:11:05', 1);
INSERT INTO `category` VALUES (9, '二级类目标题2', 2, 2, '2022-09-17 23:11:05', '2022-09-17 23:11:05', 1);
INSERT INTO `category` VALUES (10, '二级类目标题1', 2, 3, '2022-09-17 23:11:05', '2022-09-17 23:11:05', 1);
INSERT INTO `category` VALUES (11, '二级类目标题2', 2, 3, '2022-09-17 23:11:05', '2022-09-17 23:11:05', 1);
INSERT INTO `category` VALUES (12, '二级类目标题1', 2, 4, '2022-09-17 23:11:05', '2022-09-17 23:11:05', 1);
INSERT INTO `category` VALUES (13, '二级类目标题2', 2, 4, '2022-09-17 23:11:05', '2022-09-17 23:11:05', 1);
INSERT INTO `category` VALUES (14, '二级类目标题1', 2, 5, '2022-09-17 23:11:05', '2022-09-17 23:11:05', 1);
INSERT INTO `category` VALUES (15, '二级类目标题2', 2, 5, '2022-09-17 23:11:05', '2022-09-17 23:11:05', 1);
COMMIT;

-- ----------------------------
-- Table structure for customer
-- ----------------------------
DROP TABLE IF EXISTS `customer`;
CREATE TABLE `customer` (
  `CUSTOMER_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '客户ID,主键自增',
  `CUSTOMER_NAME` varchar(100) NOT NULL COMMENT '客户名称,如果为公司,那么是公司名,如果为个人,那么填写个人名称',
  `CUSTOMER_LEADER` varchar(100) NOT NULL COMMENT '客户负责人,如果公司为个人,那么和CUSTOMER_NAME内容相同',
  `CUSTOMER_TEL` varchar(100) NOT NULL COMMENT '联系电话',
  `CUSTOMER_EMAIL` varchar(100) DEFAULT NULL COMMENT '联系邮箱',
  `CUSTOMER_ADDRESS` varchar(255) DEFAULT NULL COMMENT '联系地址',
  `LEVEL_ID` int(11) NOT NULL COMMENT '客户级别,关联级别表主键',
  `SOURCE_ID` int(11) NOT NULL COMMENT '客户来源,关联来源表主键',
  `INDUSTRY_ID` int(11) NOT NULL COMMENT '客户行业,关联行业表主键',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`CUSTOMER_ID`),
  KEY `LEVEL_ID` (`LEVEL_ID`),
  KEY `SOURCE_ID` (`SOURCE_ID`),
  KEY `INDUSTRY_ID` (`INDUSTRY_ID`),
  CONSTRAINT `customer_ibfk_1` FOREIGN KEY (`LEVEL_ID`) REFERENCES `level` (`LEVEL_ID`),
  CONSTRAINT `customer_ibfk_2` FOREIGN KEY (`SOURCE_ID`) REFERENCES `source` (`SOURCE_ID`),
  CONSTRAINT `customer_ibfk_3` FOREIGN KEY (`INDUSTRY_ID`) REFERENCES `industry` (`INDUSTRY_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='客户表';

-- ----------------------------
-- Records of customer
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for department
-- ----------------------------
DROP TABLE IF EXISTS `department`;
CREATE TABLE `department` (
  `DEPT_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '部门ID',
  `DEPT_NAME` varchar(100) DEFAULT NULL COMMENT '部门名称',
  `LEVEL` int(11) DEFAULT '1' COMMENT '层级',
  `PARENT_ID` int(11) DEFAULT '0' COMMENT '父ID,自关联DEPT_ID',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`DEPT_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=33 DEFAULT CHARSET=utf8 COMMENT='部门表';

-- ----------------------------
-- Records of department
-- ----------------------------
BEGIN;
INSERT INTO `department` VALUES (1, '大萝卜股份有限公司', 1, 0, '2022-09-17 22:50:34', '2022-09-17 22:50:34', 1);
INSERT INTO `department` VALUES (2, '小萝卜股份有限公司', 1, 0, '2022-09-17 22:50:58', '2022-09-17 22:50:58', 1);
INSERT INTO `department` VALUES (3, '大萝卜子公司1', 2, 1, '2022-09-17 22:51:31', '2022-09-17 22:51:31', 1);
INSERT INTO `department` VALUES (4, '大萝卜子公司2', 2, 1, '2022-09-17 22:51:31', '2022-09-17 22:51:31', 1);
INSERT INTO `department` VALUES (5, '大萝卜子公司3', 2, 1, '2022-09-17 22:51:31', '2022-09-17 22:51:31', 1);
INSERT INTO `department` VALUES (6, '大萝卜子公司4', 2, 1, '2022-09-17 22:51:31', '2022-09-17 22:51:31', 1);
INSERT INTO `department` VALUES (7, '大萝卜子公司5', 2, 1, '2022-09-17 22:51:31', '2022-09-17 22:51:31', 1);
INSERT INTO `department` VALUES (8, '小萝卜子公司1', 2, 2, '2022-09-17 22:52:05', '2022-09-17 22:52:05', 1);
INSERT INTO `department` VALUES (9, '小萝卜子公司2', 2, 2, '2022-09-17 22:52:05', '2022-09-17 22:52:05', 1);
INSERT INTO `department` VALUES (10, '小萝卜子公司3', 2, 2, '2022-09-17 22:52:05', '2022-09-17 22:52:05', 1);
INSERT INTO `department` VALUES (11, '小萝卜子公司4', 2, 2, '2022-09-17 22:52:05', '2022-09-17 22:52:05', 1);
INSERT INTO `department` VALUES (12, '小萝卜子公司5', 2, 2, '2022-09-17 22:52:05', '2022-09-17 22:52:05', 1);
INSERT INTO `department` VALUES (13, '部门1', 3, 3, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (14, '部门2', 3, 3, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (15, '部门1', 3, 4, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (16, '部门2', 3, 4, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (17, '部门1', 3, 5, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (18, '部门2', 3, 5, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (19, '部门1', 3, 6, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (20, '部门2', 3, 6, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (21, '部门1', 3, 7, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (22, '部门2', 3, 7, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (23, '部门1', 3, 8, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (24, '部门2', 3, 8, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (25, '部门1', 3, 9, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (26, '部门2', 3, 9, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (27, '部门1', 3, 10, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (28, '部门2', 3, 10, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (29, '部门1', 3, 11, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (30, '部门2', 3, 11, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (31, '部门1', 3, 12, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
INSERT INTO `department` VALUES (32, '部门2', 3, 12, '2022-09-17 22:53:47', '2022-09-17 22:53:47', 1);
COMMIT;

-- ----------------------------
-- Table structure for industry
-- ----------------------------
DROP TABLE IF EXISTS `industry`;
CREATE TABLE `industry` (
  `INDUSTRY_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '行业ID,主键自增',
  `INDUSTRY_NAME` varchar(100) NOT NULL COMMENT '行业名称',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`INDUSTRY_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=101 DEFAULT CHARSET=utf8 COMMENT='客户行业表';

-- ----------------------------
-- Records of industry
-- ----------------------------
BEGIN;
INSERT INTO `industry` VALUES (1, '来源名称0', '2022-09-18 11:51:09', '2022-09-18 11:51:09', 1);
INSERT INTO `industry` VALUES (2, '来源名称1', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 0);
INSERT INTO `industry` VALUES (3, '来源名称2', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 1);
INSERT INTO `industry` VALUES (4, '来源名称3', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 0);
INSERT INTO `industry` VALUES (5, '来源名称4', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 1);
INSERT INTO `industry` VALUES (6, '来源名称5', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 0);
INSERT INTO `industry` VALUES (7, '来源名称6', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 1);
INSERT INTO `industry` VALUES (8, '来源名称7', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 0);
INSERT INTO `industry` VALUES (9, '来源名称8', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 1);
INSERT INTO `industry` VALUES (10, '来源名称9', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 0);
INSERT INTO `industry` VALUES (11, '来源名称10', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 1);
INSERT INTO `industry` VALUES (12, '来源名称11', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 0);
INSERT INTO `industry` VALUES (13, '来源名称12', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 1);
INSERT INTO `industry` VALUES (14, '来源名称13', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 0);
INSERT INTO `industry` VALUES (15, '来源名称14', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 1);
INSERT INTO `industry` VALUES (16, '来源名称15', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 0);
INSERT INTO `industry` VALUES (17, '来源名称16', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 1);
INSERT INTO `industry` VALUES (18, '来源名称17', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 0);
INSERT INTO `industry` VALUES (19, '来源名称18', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 1);
INSERT INTO `industry` VALUES (20, '来源名称19', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 0);
INSERT INTO `industry` VALUES (21, '来源名称20', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 1);
INSERT INTO `industry` VALUES (22, '来源名称21', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 0);
INSERT INTO `industry` VALUES (23, '来源名称22', '2022-09-18 11:51:10', '2022-09-18 11:51:09', 1);
INSERT INTO `industry` VALUES (24, '来源名称23', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (25, '来源名称24', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (26, '来源名称25', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (27, '来源名称26', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (28, '来源名称27', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (29, '来源名称28', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (30, '来源名称29', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (31, '来源名称30', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (32, '来源名称31', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (33, '来源名称32', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (34, '来源名称33', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (35, '来源名称34', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (36, '来源名称35', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (37, '来源名称36', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (38, '来源名称37', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (39, '来源名称38', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (40, '来源名称39', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (41, '来源名称40', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (42, '来源名称41', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (43, '来源名称42', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (44, '来源名称43', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (45, '来源名称44', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (46, '来源名称45', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (47, '来源名称46', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (48, '来源名称47', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (49, '来源名称48', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (50, '来源名称49', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (51, '来源名称50', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (52, '来源名称51', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (53, '来源名称52', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (54, '来源名称53', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (55, '来源名称54', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (56, '来源名称55', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (57, '来源名称56', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (58, '来源名称57', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (59, '来源名称58', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (60, '来源名称59', '2022-09-18 11:51:10', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (61, '来源名称60', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (62, '来源名称61', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (63, '来源名称62', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (64, '来源名称63', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (65, '来源名称64', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (66, '来源名称65', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (67, '来源名称66', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (68, '来源名称67', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (69, '来源名称68', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (70, '来源名称69', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (71, '来源名称70', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (72, '来源名称71', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (73, '来源名称72', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (74, '来源名称73', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (75, '来源名称74', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (76, '来源名称75', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (77, '来源名称76', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (78, '来源名称77', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (79, '来源名称78', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (80, '来源名称79', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (81, '来源名称80', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (82, '来源名称81', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (83, '来源名称82', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (84, '来源名称83', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (85, '来源名称84', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (86, '来源名称85', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (87, '来源名称86', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (88, '来源名称87', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (89, '来源名称88', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (90, '来源名称89', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (91, '来源名称90', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (92, '来源名称91', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (93, '来源名称92', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (94, '来源名称93', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (95, '来源名称94', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (96, '来源名称95', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (97, '来源名称96', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (98, '来源名称97', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
INSERT INTO `industry` VALUES (99, '来源名称98', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 1);
INSERT INTO `industry` VALUES (100, '来源名称99', '2022-09-18 11:51:11', '2022-09-18 11:51:10', 0);
COMMIT;

-- ----------------------------
-- Table structure for level
-- ----------------------------
DROP TABLE IF EXISTS `level`;
CREATE TABLE `level` (
  `LEVEL_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '客户级别ID,主键自增',
  `LEVEL_NAME` varchar(100) NOT NULL COMMENT '客户级别名称',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`LEVEL_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=101 DEFAULT CHARSET=utf8 COMMENT='客户级别表';

-- ----------------------------
-- Records of level
-- ----------------------------
BEGIN;
INSERT INTO `level` VALUES (1, '级别0', '2022-09-18 11:17:36', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (2, '级别1', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (3, '级别2', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (4, '级别3', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (5, '级别4', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (6, '级别5', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (7, '级别6', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (8, '级别7', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (9, '级别8', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (10, '级别9', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (11, '级别10', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (12, '级别11', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (13, '级别12', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (14, '级别13', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (15, '级别14', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (16, '级别15', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (17, '级别16', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (18, '级别17', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (19, '级别18', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (20, '级别19', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (21, '级别20', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (22, '级别21', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (23, '级别22', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (24, '级别23', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (25, '级别24', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (26, '级别25', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (27, '级别26', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (28, '级别27', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (29, '级别28', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (30, '级别29', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (31, '级别30', '2022-09-18 11:17:37', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (32, '级别31', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (33, '级别32', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (34, '级别33', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (35, '级别34', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (36, '级别35', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (37, '级别36', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (38, '级别37', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (39, '级别38', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (40, '级别39', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (41, '级别40', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (42, '级别41', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (43, '级别42', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (44, '级别43', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (45, '级别44', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (46, '级别45', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (47, '级别46', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (48, '级别47', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (49, '级别48', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (50, '级别49', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (51, '级别50', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (52, '级别51', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (53, '级别52', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (54, '级别53', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (55, '级别54', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (56, '级别55', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (57, '级别56', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (58, '级别57', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (59, '级别58', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (60, '级别59', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (61, '级别60', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (62, '级别61', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (63, '级别62', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (64, '级别63', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (65, '级别64', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (66, '级别65', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (67, '级别66', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (68, '级别67', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 0);
INSERT INTO `level` VALUES (69, '级别68', '2022-09-18 11:17:38', '2022-09-18 11:17:37', 1);
INSERT INTO `level` VALUES (70, '级别69', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
INSERT INTO `level` VALUES (71, '级别70', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 1);
INSERT INTO `level` VALUES (72, '级别71', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
INSERT INTO `level` VALUES (73, '级别72', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 1);
INSERT INTO `level` VALUES (74, '级别73', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
INSERT INTO `level` VALUES (75, '级别74', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 1);
INSERT INTO `level` VALUES (76, '级别75', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
INSERT INTO `level` VALUES (77, '级别76', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 1);
INSERT INTO `level` VALUES (78, '级别77', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
INSERT INTO `level` VALUES (79, '级别78', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 1);
INSERT INTO `level` VALUES (80, '级别79', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
INSERT INTO `level` VALUES (81, '级别80', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 1);
INSERT INTO `level` VALUES (82, '级别81', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
INSERT INTO `level` VALUES (83, '级别82', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 1);
INSERT INTO `level` VALUES (84, '级别83', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
INSERT INTO `level` VALUES (85, '级别84', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 1);
INSERT INTO `level` VALUES (86, '级别85', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
INSERT INTO `level` VALUES (87, '级别86', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 1);
INSERT INTO `level` VALUES (88, '级别87', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
INSERT INTO `level` VALUES (89, '级别88', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 1);
INSERT INTO `level` VALUES (90, '级别89', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
INSERT INTO `level` VALUES (91, '级别90', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 1);
INSERT INTO `level` VALUES (92, '级别91', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
INSERT INTO `level` VALUES (93, '级别92', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 1);
INSERT INTO `level` VALUES (94, '级别93', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
INSERT INTO `level` VALUES (95, '级别94', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 1);
INSERT INTO `level` VALUES (96, '级别95', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
INSERT INTO `level` VALUES (97, '级别96', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 1);
INSERT INTO `level` VALUES (98, '级别97', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
INSERT INTO `level` VALUES (99, '级别98', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 1);
INSERT INTO `level` VALUES (100, '级别99', '2022-09-18 11:17:38', '2022-09-18 11:17:38', 0);
COMMIT;

-- ----------------------------
-- Table structure for menus
-- ----------------------------
DROP TABLE IF EXISTS `menus`;
CREATE TABLE `menus` (
  `MENU_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '菜单ID,主键自增',
  `MENU_NAME` varchar(100) NOT NULL COMMENT '菜单名称',
  `MENU_URL` varchar(255) DEFAULT NULL COMMENT '菜单地址',
  `LEVEL` int(11) DEFAULT '1' COMMENT '层级',
  `PARENT_ID` int(11) DEFAULT NULL COMMENT '父ID,关联menus表主键,默认值为0,表示菜单第一级',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '菜单状态 0:删除 1:未删除',
  PRIMARY KEY (`MENU_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COMMENT='菜单表';

-- ----------------------------
-- Records of menus
-- ----------------------------
BEGIN;
INSERT INTO `menus` VALUES (1, '顶级菜单标题1', NULL, 1, 0, '2022-09-17 22:55:38', '2022-09-17 22:55:38', 1);
INSERT INTO `menus` VALUES (2, '顶级菜单标题2', NULL, 1, 0, '2022-09-17 22:55:38', '2022-09-17 22:55:38', 1);
INSERT INTO `menus` VALUES (3, '顶级菜单标题3', NULL, 1, 0, '2022-09-17 22:55:38', '2022-09-17 22:55:38', 1);
INSERT INTO `menus` VALUES (4, '顶级菜单标题4', NULL, 1, 0, '2022-09-17 22:55:38', '2022-09-17 22:55:38', 1);
INSERT INTO `menus` VALUES (5, '顶级菜单标题5', NULL, 1, 0, '2022-09-17 22:55:38', '2022-09-17 22:55:38', 1);
INSERT INTO `menus` VALUES (6, '子集菜单标题1', NULL, 2, 1, '2022-09-17 22:56:49', '2022-09-17 22:56:49', 1);
INSERT INTO `menus` VALUES (7, '子集菜单标题2', NULL, 2, 1, '2022-09-17 22:56:49', '2022-09-17 22:56:49', 1);
INSERT INTO `menus` VALUES (8, '子集菜单标题1', NULL, 2, 2, '2022-09-17 22:56:49', '2022-09-17 22:56:49', 1);
INSERT INTO `menus` VALUES (9, '子集菜单标题2', NULL, 2, 2, '2022-09-17 22:56:49', '2022-09-17 22:56:49', 1);
INSERT INTO `menus` VALUES (10, '子集菜单标题1', NULL, 2, 3, '2022-09-17 22:56:49', '2022-09-17 22:56:49', 1);
INSERT INTO `menus` VALUES (11, '子集菜单标题2', NULL, 2, 3, '2022-09-17 22:56:49', '2022-09-17 22:56:49', 1);
INSERT INTO `menus` VALUES (12, '子集菜单标题1', NULL, 2, 4, '2022-09-17 22:56:49', '2022-09-17 22:56:49', 1);
INSERT INTO `menus` VALUES (13, '子集菜单标题2', NULL, 2, 4, '2022-09-17 22:56:49', '2022-09-17 22:56:49', 1);
INSERT INTO `menus` VALUES (14, '子集菜单标题1', NULL, 2, 5, '2022-09-17 22:56:49', '2022-09-17 22:56:49', 1);
INSERT INTO `menus` VALUES (15, '子集菜单标题2', NULL, 2, 5, '2022-09-17 22:56:49', '2022-09-17 22:56:49', 1);
COMMIT;

-- ----------------------------
-- Table structure for product
-- ----------------------------
DROP TABLE IF EXISTS `product`;
CREATE TABLE `product` (
  `PRODUCT_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '产品ID,主键自增',
  `PRODUCT_NAME` varchar(100) NOT NULL COMMENT '产品名称',
  `CATEGORY_ID` int(11) NOT NULL COMMENT '产品类目ID,关联类目表主键',
  `PRODUCT_SIZE` varchar(100) DEFAULT NULL COMMENT '产品尺寸(长乘宽),单位 毫米(mm)',
  `PRODUCT_PRICE` double(16,3) DEFAULT NULL COMMENT '产品价格',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`PRODUCT_ID`),
  KEY `CATEGORY_ID` (`CATEGORY_ID`),
  CONSTRAINT `product_ibfk_1` FOREIGN KEY (`CATEGORY_ID`) REFERENCES `category` (`CATEGORY_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='产品信息表';

-- ----------------------------
-- Records of product
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for record_in
-- ----------------------------
DROP TABLE IF EXISTS `record_in`;
CREATE TABLE `record_in` (
  `RECORD_IN_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '入库ID,主键自增',
  `SUPPLIER_ID` int(11) NOT NULL COMMENT '供应商ID,关联供应商表主键',
  `PRODUCT_ID` int(11) NOT NULL COMMENT '产品ID,关联产品表主键',
  `RECORD_IN_NUMBER` int(11) DEFAULT '0' COMMENT '入库数量',
  `RECORD_IN_TIME` datetime DEFAULT NULL COMMENT '入库时间',
  `USER_ID` int(11) NOT NULL COMMENT '入库负责人ID,关联用户表主键',
  `REPO_ID` int(11) NOT NULL COMMENT '仓库ID,关联仓库表主键',
  `REMARKS` varchar(255) DEFAULT NULL COMMENT '备注',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`RECORD_IN_ID`),
  KEY `SUPPLIER_ID` (`SUPPLIER_ID`),
  KEY `PRODUCT_ID` (`PRODUCT_ID`),
  KEY `USER_ID` (`USER_ID`),
  CONSTRAINT `record_in_ibfk_1` FOREIGN KEY (`SUPPLIER_ID`) REFERENCES `supplier` (`SUPPLIER_ID`),
  CONSTRAINT `record_in_ibfk_2` FOREIGN KEY (`PRODUCT_ID`) REFERENCES `product` (`PRODUCT_ID`),
  CONSTRAINT `record_in_ibfk_3` FOREIGN KEY (`USER_ID`) REFERENCES `user` (`USER_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='入库记录表';

-- ----------------------------
-- Records of record_in
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for record_out
-- ----------------------------
DROP TABLE IF EXISTS `record_out`;
CREATE TABLE `record_out` (
  `RECORD_OUT_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '出库ID,主键自增',
  `CUSTOMER_ID` int(11) NOT NULL COMMENT '客户ID,关联客户表主键',
  `PRODUCT_ID` int(11) NOT NULL COMMENT '产品ID,关联产品表主键',
  `RECORD_OUT_NUMBER` int(11) DEFAULT '0' COMMENT '出库数量',
  `RECORD_OUT_TIME` datetime DEFAULT NULL COMMENT '出库时间',
  `USER_ID` int(11) NOT NULL COMMENT '出库负责人ID,关联用户表主键',
  `REPO_ID` int(11) NOT NULL COMMENT '仓库ID,关联仓库表主键',
  `REMARKS` varchar(255) DEFAULT NULL COMMENT '备注',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`RECORD_OUT_ID`),
  KEY `CUSTOMER_ID` (`CUSTOMER_ID`),
  KEY `PRODUCT_ID` (`PRODUCT_ID`),
  KEY `USER_ID` (`USER_ID`),
  CONSTRAINT `record_out_ibfk_1` FOREIGN KEY (`CUSTOMER_ID`) REFERENCES `customer` (`CUSTOMER_ID`),
  CONSTRAINT `record_out_ibfk_2` FOREIGN KEY (`PRODUCT_ID`) REFERENCES `product` (`PRODUCT_ID`),
  CONSTRAINT `record_out_ibfk_3` FOREIGN KEY (`USER_ID`) REFERENCES `user` (`USER_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='出库记录表';

-- ----------------------------
-- Records of record_out
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for record_stock
-- ----------------------------
DROP TABLE IF EXISTS `record_stock`;
CREATE TABLE `record_stock` (
  `PRODUCT_ID` int(11) NOT NULL COMMENT '产品ID,关联产品表主键',
  `REPO_ID` int(11) NOT NULL COMMENT '仓库ID,关联仓库表主键',
  `PRODUCT_STOCK` int(11) DEFAULT '0' COMMENT '库存数量',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`PRODUCT_ID`,`REPO_ID`),
  KEY `REPO_ID` (`REPO_ID`),
  CONSTRAINT `record_stock_ibfk_1` FOREIGN KEY (`PRODUCT_ID`) REFERENCES `product` (`PRODUCT_ID`),
  CONSTRAINT `record_stock_ibfk_2` FOREIGN KEY (`REPO_ID`) REFERENCES `repository` (`REPO_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='库存记录表';

-- ----------------------------
-- Records of record_stock
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for repository
-- ----------------------------
DROP TABLE IF EXISTS `repository`;
CREATE TABLE `repository` (
  `REPO_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '仓库ID,主键自增',
  `REPO_ADDRESS` varchar(100) NOT NULL COMMENT '仓库地址',
  `REPO_AREA` varchar(50) DEFAULT NULL COMMENT '仓库面积,单位:平方米',
  `REPO_DESC` varchar(255) DEFAULT NULL COMMENT '仓库描述(备注)',
  `REPO_STATUS` tinyint(4) DEFAULT '1' COMMENT '仓库状态 0:故障 1:正常 2:已满 3:废弃',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`REPO_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='仓库信息表';

-- ----------------------------
-- Records of repository
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for role
-- ----------------------------
DROP TABLE IF EXISTS `role`;
CREATE TABLE `role` (
  `ROLE_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '角色ID,主键自增',
  `ROLE_NAME` varchar(100) DEFAULT NULL COMMENT '角色名称',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`ROLE_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=101 DEFAULT CHARSET=utf8 COMMENT='角色表';

-- ----------------------------
-- Records of role
-- ----------------------------
BEGIN;
INSERT INTO `role` VALUES (1, '测试角色名称0', '2022-09-17 22:48:18', '2022-09-17 22:48:18', 1);
INSERT INTO `role` VALUES (2, '测试角色名称1', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 0);
INSERT INTO `role` VALUES (3, '测试角色名称2', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 1);
INSERT INTO `role` VALUES (4, '测试角色名称3', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 0);
INSERT INTO `role` VALUES (5, '测试角色名称4', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 1);
INSERT INTO `role` VALUES (6, '测试角色名称5', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 0);
INSERT INTO `role` VALUES (7, '测试角色名称6', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 1);
INSERT INTO `role` VALUES (8, '测试角色名称7', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 0);
INSERT INTO `role` VALUES (9, '测试角色名称8', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 1);
INSERT INTO `role` VALUES (10, '测试角色名称9', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 0);
INSERT INTO `role` VALUES (11, '测试角色名称10', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 1);
INSERT INTO `role` VALUES (12, '测试角色名称11', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 0);
INSERT INTO `role` VALUES (13, '测试角色名称12', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 1);
INSERT INTO `role` VALUES (14, '测试角色名称13', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 0);
INSERT INTO `role` VALUES (15, '测试角色名称14', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 1);
INSERT INTO `role` VALUES (16, '测试角色名称15', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 0);
INSERT INTO `role` VALUES (17, '测试角色名称16', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 1);
INSERT INTO `role` VALUES (18, '测试角色名称17', '2022-09-17 22:48:19', '2022-09-17 22:48:18', 0);
INSERT INTO `role` VALUES (19, '测试角色名称18', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (20, '测试角色名称19', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (21, '测试角色名称20', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (22, '测试角色名称21', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (23, '测试角色名称22', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (24, '测试角色名称23', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (25, '测试角色名称24', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (26, '测试角色名称25', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (27, '测试角色名称26', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (28, '测试角色名称27', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (29, '测试角色名称28', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (30, '测试角色名称29', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (31, '测试角色名称30', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (32, '测试角色名称31', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (33, '测试角色名称32', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (34, '测试角色名称33', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (35, '测试角色名称34', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (36, '测试角色名称35', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (37, '测试角色名称36', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (38, '测试角色名称37', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (39, '测试角色名称38', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (40, '测试角色名称39', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (41, '测试角色名称40', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (42, '测试角色名称41', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (43, '测试角色名称42', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (44, '测试角色名称43', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (45, '测试角色名称44', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (46, '测试角色名称45', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (47, '测试角色名称46', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (48, '测试角色名称47', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (49, '测试角色名称48', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (50, '测试角色名称49', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (51, '测试角色名称50', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (52, '测试角色名称51', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (53, '测试角色名称52', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (54, '测试角色名称53', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (55, '测试角色名称54', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (56, '测试角色名称55', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (57, '测试角色名称56', '2022-09-17 22:48:19', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (58, '测试角色名称57', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (59, '测试角色名称58', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (60, '测试角色名称59', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (61, '测试角色名称60', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (62, '测试角色名称61', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (63, '测试角色名称62', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (64, '测试角色名称63', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (65, '测试角色名称64', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (66, '测试角色名称65', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (67, '测试角色名称66', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (68, '测试角色名称67', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (69, '测试角色名称68', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (70, '测试角色名称69', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (71, '测试角色名称70', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (72, '测试角色名称71', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (73, '测试角色名称72', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (74, '测试角色名称73', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (75, '测试角色名称74', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (76, '测试角色名称75', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (77, '测试角色名称76', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (78, '测试角色名称77', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (79, '测试角色名称78', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (80, '测试角色名称79', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (81, '测试角色名称80', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (82, '测试角色名称81', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (83, '测试角色名称82', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (84, '测试角色名称83', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (85, '测试角色名称84', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (86, '测试角色名称85', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (87, '测试角色名称86', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (88, '测试角色名称87', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (89, '测试角色名称88', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (90, '测试角色名称89', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (91, '测试角色名称90', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (92, '测试角色名称91', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (93, '测试角色名称92', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (94, '测试角色名称93', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (95, '测试角色名称94', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 1);
INSERT INTO `role` VALUES (96, '测试角色名称95', '2022-09-17 22:48:20', '2022-09-17 22:48:19', 0);
INSERT INTO `role` VALUES (97, '测试角色名称96', '2022-09-17 22:48:20', '2022-09-17 22:48:20', 1);
INSERT INTO `role` VALUES (98, '测试角色名称97', '2022-09-17 22:48:20', '2022-09-17 22:48:20', 0);
INSERT INTO `role` VALUES (99, '测试角色名称98', '2022-09-17 22:48:20', '2022-09-17 22:48:20', 1);
INSERT INTO `role` VALUES (100, '测试角色名称99', '2022-09-17 22:48:20', '2022-09-17 22:48:20', 0);
COMMIT;

-- ----------------------------
-- Table structure for role_menus
-- ----------------------------
DROP TABLE IF EXISTS `role_menus`;
CREATE TABLE `role_menus` (
  `ROLE_ID` int(11) NOT NULL COMMENT '角色ID,关联角色表主键',
  `MENU_ID` int(11) NOT NULL COMMENT '菜单ID,关联菜单表主键',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`ROLE_ID`,`MENU_ID`),
  KEY `MENU_ID` (`MENU_ID`),
  CONSTRAINT `role_menus_ibfk_1` FOREIGN KEY (`ROLE_ID`) REFERENCES `role` (`ROLE_ID`),
  CONSTRAINT `role_menus_ibfk_2` FOREIGN KEY (`MENU_ID`) REFERENCES `menus` (`MENU_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='角色菜单关联表';

-- ----------------------------
-- Records of role_menus
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for source
-- ----------------------------
DROP TABLE IF EXISTS `source`;
CREATE TABLE `source` (
  `SOURCE_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '客户来源ID,主键自增',
  `SOURCE_NAME` varchar(100) NOT NULL COMMENT '客户来源名称',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`SOURCE_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=101 DEFAULT CHARSET=utf8 COMMENT='客户来源表';

-- ----------------------------
-- Records of source
-- ----------------------------
BEGIN;
INSERT INTO `source` VALUES (1, '来源名称0', '2022-09-18 11:37:47', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (2, '来源名称1', '2022-09-18 11:37:47', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (3, '来源名称2', '2022-09-18 11:37:47', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (4, '来源名称3', '2022-09-18 11:37:47', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (5, '来源名称4', '2022-09-18 11:37:47', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (6, '来源名称5', '2022-09-18 11:37:47', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (7, '来源名称6', '2022-09-18 11:37:47', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (8, '来源名称7', '2022-09-18 11:37:47', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (9, '来源名称8', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (10, '来源名称9', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (11, '来源名称10', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (12, '来源名称11', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (13, '来源名称12', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (14, '来源名称13', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (15, '来源名称14', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (16, '来源名称15', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (17, '来源名称16', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (18, '来源名称17', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (19, '来源名称18', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (20, '来源名称19', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (21, '来源名称20', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (22, '来源名称21', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (23, '来源名称22', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (24, '来源名称23', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (25, '来源名称24', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (26, '来源名称25', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (27, '来源名称26', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (28, '来源名称27', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (29, '来源名称28', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (30, '来源名称29', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (31, '来源名称30', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (32, '来源名称31', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (33, '来源名称32', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (34, '来源名称33', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (35, '来源名称34', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (36, '来源名称35', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (37, '来源名称36', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (38, '来源名称37', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (39, '来源名称38', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (40, '来源名称39', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (41, '来源名称40', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (42, '来源名称41', '2022-09-18 11:37:48', '2022-09-18 11:37:47', 1);
INSERT INTO `source` VALUES (43, '来源名称42', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (44, '来源名称43', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (45, '来源名称44', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (46, '来源名称45', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (47, '来源名称46', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (48, '来源名称47', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (49, '来源名称48', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (50, '来源名称49', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (51, '来源名称50', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (52, '来源名称51', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (53, '来源名称52', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (54, '来源名称53', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (55, '来源名称54', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (56, '来源名称55', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (57, '来源名称56', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (58, '来源名称57', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (59, '来源名称58', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (60, '来源名称59', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (61, '来源名称60', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (62, '来源名称61', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (63, '来源名称62', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (64, '来源名称63', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (65, '来源名称64', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (66, '来源名称65', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (67, '来源名称66', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (68, '来源名称67', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (69, '来源名称68', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (70, '来源名称69', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (71, '来源名称70', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (72, '来源名称71', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (73, '来源名称72', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (74, '来源名称73', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (75, '来源名称74', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (76, '来源名称75', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (77, '来源名称76', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (78, '来源名称77', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (79, '来源名称78', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (80, '来源名称79', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (81, '来源名称80', '2022-09-18 11:37:48', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (82, '来源名称81', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (83, '来源名称82', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (84, '来源名称83', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (85, '来源名称84', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (86, '来源名称85', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (87, '来源名称86', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (88, '来源名称87', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (89, '来源名称88', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (90, '来源名称89', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (91, '来源名称90', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (92, '来源名称91', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (93, '来源名称92', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (94, '来源名称93', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (95, '来源名称94', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (96, '来源名称95', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (97, '来源名称96', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (98, '来源名称97', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (99, '来源名称98', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
INSERT INTO `source` VALUES (100, '来源名称99', '2022-09-18 11:37:49', '2022-09-18 11:37:48', 1);
COMMIT;

-- ----------------------------
-- Table structure for supplier
-- ----------------------------
DROP TABLE IF EXISTS `supplier`;
CREATE TABLE `supplier` (
  `SUPPLIER_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '供应商ID,主键自增',
  `SUPPLIER_NAME` varchar(100) NOT NULL COMMENT '供应商信息,如果为个人(非公司),那么当前字段和SUPPLIER_LEADER信息相同,如果为公司,那么是公司名称',
  `SUPPLIER_LEADER` varchar(100) NOT NULL COMMENT '负责人,如果为个人(非公司),那么当前字段和SUPPLIER_NAME信息相同',
  `SUPPLIER_TEL` varchar(100) NOT NULL COMMENT '联系电话',
  `SUPPLIER_EMAIL` varchar(100) NOT NULL COMMENT '邮箱',
  `SUPPLIER_ADDRESS` varchar(100) NOT NULL COMMENT '地址',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`SUPPLIER_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=101 DEFAULT CHARSET=utf8 COMMENT='供应商信息表';

-- ----------------------------
-- Records of supplier
-- ----------------------------
BEGIN;
INSERT INTO `supplier` VALUES (1, '测试供应商名称0', '测试供应商负责人0', '测试供应商联系电话0', '测试供应商邮箱0', '测试供应商地址0', '2022-09-18 21:26:08', '2022-09-18 21:26:07', 1);
INSERT INTO `supplier` VALUES (2, '测试供应商名称1', '测试供应商负责人1', '测试供应商联系电话1', '测试供应商邮箱1', '测试供应商地址1', '2022-09-18 21:26:08', '2022-09-18 21:26:07', 0);
INSERT INTO `supplier` VALUES (3, '测试供应商名称2', '测试供应商负责人2', '测试供应商联系电话2', '测试供应商邮箱2', '测试供应商地址2', '2022-09-18 21:26:08', '2022-09-18 21:26:07', 1);
INSERT INTO `supplier` VALUES (4, '测试供应商名称3', '测试供应商负责人3', '测试供应商联系电话3', '测试供应商邮箱3', '测试供应商地址3', '2022-09-18 21:26:08', '2022-09-18 21:26:07', 0);
INSERT INTO `supplier` VALUES (5, '测试供应商名称4', '测试供应商负责人4', '测试供应商联系电话4', '测试供应商邮箱4', '测试供应商地址4', '2022-09-18 21:26:08', '2022-09-18 21:26:07', 1);
INSERT INTO `supplier` VALUES (6, '测试供应商名称5', '测试供应商负责人5', '测试供应商联系电话5', '测试供应商邮箱5', '测试供应商地址5', '2022-09-18 21:26:08', '2022-09-18 21:26:07', 0);
INSERT INTO `supplier` VALUES (7, '测试供应商名称6', '测试供应商负责人6', '测试供应商联系电话6', '测试供应商邮箱6', '测试供应商地址6', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (8, '测试供应商名称7', '测试供应商负责人7', '测试供应商联系电话7', '测试供应商邮箱7', '测试供应商地址7', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (9, '测试供应商名称8', '测试供应商负责人8', '测试供应商联系电话8', '测试供应商邮箱8', '测试供应商地址8', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (10, '测试供应商名称9', '测试供应商负责人9', '测试供应商联系电话9', '测试供应商邮箱9', '测试供应商地址9', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (11, '测试供应商名称10', '测试供应商负责人10', '测试供应商联系电话10', '测试供应商邮箱10', '测试供应商地址10', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (12, '测试供应商名称11', '测试供应商负责人11', '测试供应商联系电话11', '测试供应商邮箱11', '测试供应商地址11', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (13, '测试供应商名称12', '测试供应商负责人12', '测试供应商联系电话12', '测试供应商邮箱12', '测试供应商地址12', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (14, '测试供应商名称13', '测试供应商负责人13', '测试供应商联系电话13', '测试供应商邮箱13', '测试供应商地址13', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (15, '测试供应商名称14', '测试供应商负责人14', '测试供应商联系电话14', '测试供应商邮箱14', '测试供应商地址14', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (16, '测试供应商名称15', '测试供应商负责人15', '测试供应商联系电话15', '测试供应商邮箱15', '测试供应商地址15', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (17, '测试供应商名称16', '测试供应商负责人16', '测试供应商联系电话16', '测试供应商邮箱16', '测试供应商地址16', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (18, '测试供应商名称17', '测试供应商负责人17', '测试供应商联系电话17', '测试供应商邮箱17', '测试供应商地址17', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (19, '测试供应商名称18', '测试供应商负责人18', '测试供应商联系电话18', '测试供应商邮箱18', '测试供应商地址18', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (20, '测试供应商名称19', '测试供应商负责人19', '测试供应商联系电话19', '测试供应商邮箱19', '测试供应商地址19', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (21, '测试供应商名称20', '测试供应商负责人20', '测试供应商联系电话20', '测试供应商邮箱20', '测试供应商地址20', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (22, '测试供应商名称21', '测试供应商负责人21', '测试供应商联系电话21', '测试供应商邮箱21', '测试供应商地址21', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (23, '测试供应商名称22', '测试供应商负责人22', '测试供应商联系电话22', '测试供应商邮箱22', '测试供应商地址22', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (24, '测试供应商名称23', '测试供应商负责人23', '测试供应商联系电话23', '测试供应商邮箱23', '测试供应商地址23', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (25, '测试供应商名称24', '测试供应商负责人24', '测试供应商联系电话24', '测试供应商邮箱24', '测试供应商地址24', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (26, '测试供应商名称25', '测试供应商负责人25', '测试供应商联系电话25', '测试供应商邮箱25', '测试供应商地址25', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (27, '测试供应商名称26', '测试供应商负责人26', '测试供应商联系电话26', '测试供应商邮箱26', '测试供应商地址26', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (28, '测试供应商名称27', '测试供应商负责人27', '测试供应商联系电话27', '测试供应商邮箱27', '测试供应商地址27', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (29, '测试供应商名称28', '测试供应商负责人28', '测试供应商联系电话28', '测试供应商邮箱28', '测试供应商地址28', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (30, '测试供应商名称29', '测试供应商负责人29', '测试供应商联系电话29', '测试供应商邮箱29', '测试供应商地址29', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (31, '测试供应商名称30', '测试供应商负责人30', '测试供应商联系电话30', '测试供应商邮箱30', '测试供应商地址30', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (32, '测试供应商名称31', '测试供应商负责人31', '测试供应商联系电话31', '测试供应商邮箱31', '测试供应商地址31', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (33, '测试供应商名称32', '测试供应商负责人32', '测试供应商联系电话32', '测试供应商邮箱32', '测试供应商地址32', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (34, '测试供应商名称33', '测试供应商负责人33', '测试供应商联系电话33', '测试供应商邮箱33', '测试供应商地址33', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (35, '测试供应商名称34', '测试供应商负责人34', '测试供应商联系电话34', '测试供应商邮箱34', '测试供应商地址34', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (36, '测试供应商名称35', '测试供应商负责人35', '测试供应商联系电话35', '测试供应商邮箱35', '测试供应商地址35', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (37, '测试供应商名称36', '测试供应商负责人36', '测试供应商联系电话36', '测试供应商邮箱36', '测试供应商地址36', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (38, '测试供应商名称37', '测试供应商负责人37', '测试供应商联系电话37', '测试供应商邮箱37', '测试供应商地址37', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (39, '测试供应商名称38', '测试供应商负责人38', '测试供应商联系电话38', '测试供应商邮箱38', '测试供应商地址38', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (40, '测试供应商名称39', '测试供应商负责人39', '测试供应商联系电话39', '测试供应商邮箱39', '测试供应商地址39', '2022-09-18 21:26:08', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (41, '测试供应商名称40', '测试供应商负责人40', '测试供应商联系电话40', '测试供应商邮箱40', '测试供应商地址40', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (42, '测试供应商名称41', '测试供应商负责人41', '测试供应商联系电话41', '测试供应商邮箱41', '测试供应商地址41', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (43, '测试供应商名称42', '测试供应商负责人42', '测试供应商联系电话42', '测试供应商邮箱42', '测试供应商地址42', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (44, '测试供应商名称43', '测试供应商负责人43', '测试供应商联系电话43', '测试供应商邮箱43', '测试供应商地址43', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (45, '测试供应商名称44', '测试供应商负责人44', '测试供应商联系电话44', '测试供应商邮箱44', '测试供应商地址44', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (46, '测试供应商名称45', '测试供应商负责人45', '测试供应商联系电话45', '测试供应商邮箱45', '测试供应商地址45', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (47, '测试供应商名称46', '测试供应商负责人46', '测试供应商联系电话46', '测试供应商邮箱46', '测试供应商地址46', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (48, '测试供应商名称47', '测试供应商负责人47', '测试供应商联系电话47', '测试供应商邮箱47', '测试供应商地址47', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (49, '测试供应商名称48', '测试供应商负责人48', '测试供应商联系电话48', '测试供应商邮箱48', '测试供应商地址48', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (50, '测试供应商名称49', '测试供应商负责人49', '测试供应商联系电话49', '测试供应商邮箱49', '测试供应商地址49', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (51, '测试供应商名称50', '测试供应商负责人50', '测试供应商联系电话50', '测试供应商邮箱50', '测试供应商地址50', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (52, '测试供应商名称51', '测试供应商负责人51', '测试供应商联系电话51', '测试供应商邮箱51', '测试供应商地址51', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (53, '测试供应商名称52', '测试供应商负责人52', '测试供应商联系电话52', '测试供应商邮箱52', '测试供应商地址52', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (54, '测试供应商名称53', '测试供应商负责人53', '测试供应商联系电话53', '测试供应商邮箱53', '测试供应商地址53', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (55, '测试供应商名称54', '测试供应商负责人54', '测试供应商联系电话54', '测试供应商邮箱54', '测试供应商地址54', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (56, '测试供应商名称55', '测试供应商负责人55', '测试供应商联系电话55', '测试供应商邮箱55', '测试供应商地址55', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (57, '测试供应商名称56', '测试供应商负责人56', '测试供应商联系电话56', '测试供应商邮箱56', '测试供应商地址56', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (58, '测试供应商名称57', '测试供应商负责人57', '测试供应商联系电话57', '测试供应商邮箱57', '测试供应商地址57', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (59, '测试供应商名称58', '测试供应商负责人58', '测试供应商联系电话58', '测试供应商邮箱58', '测试供应商地址58', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (60, '测试供应商名称59', '测试供应商负责人59', '测试供应商联系电话59', '测试供应商邮箱59', '测试供应商地址59', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (61, '测试供应商名称60', '测试供应商负责人60', '测试供应商联系电话60', '测试供应商邮箱60', '测试供应商地址60', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (62, '测试供应商名称61', '测试供应商负责人61', '测试供应商联系电话61', '测试供应商邮箱61', '测试供应商地址61', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (63, '测试供应商名称62', '测试供应商负责人62', '测试供应商联系电话62', '测试供应商邮箱62', '测试供应商地址62', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (64, '测试供应商名称63', '测试供应商负责人63', '测试供应商联系电话63', '测试供应商邮箱63', '测试供应商地址63', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (65, '测试供应商名称64', '测试供应商负责人64', '测试供应商联系电话64', '测试供应商邮箱64', '测试供应商地址64', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (66, '测试供应商名称65', '测试供应商负责人65', '测试供应商联系电话65', '测试供应商邮箱65', '测试供应商地址65', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (67, '测试供应商名称66', '测试供应商负责人66', '测试供应商联系电话66', '测试供应商邮箱66', '测试供应商地址66', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (68, '测试供应商名称67', '测试供应商负责人67', '测试供应商联系电话67', '测试供应商邮箱67', '测试供应商地址67', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (69, '测试供应商名称68', '测试供应商负责人68', '测试供应商联系电话68', '测试供应商邮箱68', '测试供应商地址68', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (70, '测试供应商名称69', '测试供应商负责人69', '测试供应商联系电话69', '测试供应商邮箱69', '测试供应商地址69', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (71, '测试供应商名称70', '测试供应商负责人70', '测试供应商联系电话70', '测试供应商邮箱70', '测试供应商地址70', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (72, '测试供应商名称71', '测试供应商负责人71', '测试供应商联系电话71', '测试供应商邮箱71', '测试供应商地址71', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (73, '测试供应商名称72', '测试供应商负责人72', '测试供应商联系电话72', '测试供应商邮箱72', '测试供应商地址72', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (74, '测试供应商名称73', '测试供应商负责人73', '测试供应商联系电话73', '测试供应商邮箱73', '测试供应商地址73', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (75, '测试供应商名称74', '测试供应商负责人74', '测试供应商联系电话74', '测试供应商邮箱74', '测试供应商地址74', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (76, '测试供应商名称75', '测试供应商负责人75', '测试供应商联系电话75', '测试供应商邮箱75', '测试供应商地址75', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 0);
INSERT INTO `supplier` VALUES (77, '测试供应商名称76', '测试供应商负责人76', '测试供应商联系电话76', '测试供应商邮箱76', '测试供应商地址76', '2022-09-18 21:26:09', '2022-09-18 21:26:08', 1);
INSERT INTO `supplier` VALUES (78, '测试供应商名称77', '测试供应商负责人77', '测试供应商联系电话77', '测试供应商邮箱77', '测试供应商地址77', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 0);
INSERT INTO `supplier` VALUES (79, '测试供应商名称78', '测试供应商负责人78', '测试供应商联系电话78', '测试供应商邮箱78', '测试供应商地址78', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 1);
INSERT INTO `supplier` VALUES (80, '测试供应商名称79', '测试供应商负责人79', '测试供应商联系电话79', '测试供应商邮箱79', '测试供应商地址79', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 0);
INSERT INTO `supplier` VALUES (81, '测试供应商名称80', '测试供应商负责人80', '测试供应商联系电话80', '测试供应商邮箱80', '测试供应商地址80', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 1);
INSERT INTO `supplier` VALUES (82, '测试供应商名称81', '测试供应商负责人81', '测试供应商联系电话81', '测试供应商邮箱81', '测试供应商地址81', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 0);
INSERT INTO `supplier` VALUES (83, '测试供应商名称82', '测试供应商负责人82', '测试供应商联系电话82', '测试供应商邮箱82', '测试供应商地址82', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 1);
INSERT INTO `supplier` VALUES (84, '测试供应商名称83', '测试供应商负责人83', '测试供应商联系电话83', '测试供应商邮箱83', '测试供应商地址83', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 0);
INSERT INTO `supplier` VALUES (85, '测试供应商名称84', '测试供应商负责人84', '测试供应商联系电话84', '测试供应商邮箱84', '测试供应商地址84', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 1);
INSERT INTO `supplier` VALUES (86, '测试供应商名称85', '测试供应商负责人85', '测试供应商联系电话85', '测试供应商邮箱85', '测试供应商地址85', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 0);
INSERT INTO `supplier` VALUES (87, '测试供应商名称86', '测试供应商负责人86', '测试供应商联系电话86', '测试供应商邮箱86', '测试供应商地址86', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 1);
INSERT INTO `supplier` VALUES (88, '测试供应商名称87', '测试供应商负责人87', '测试供应商联系电话87', '测试供应商邮箱87', '测试供应商地址87', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 0);
INSERT INTO `supplier` VALUES (89, '测试供应商名称88', '测试供应商负责人88', '测试供应商联系电话88', '测试供应商邮箱88', '测试供应商地址88', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 1);
INSERT INTO `supplier` VALUES (90, '测试供应商名称89', '测试供应商负责人89', '测试供应商联系电话89', '测试供应商邮箱89', '测试供应商地址89', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 0);
INSERT INTO `supplier` VALUES (91, '测试供应商名称90', '测试供应商负责人90', '测试供应商联系电话90', '测试供应商邮箱90', '测试供应商地址90', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 1);
INSERT INTO `supplier` VALUES (92, '测试供应商名称91', '测试供应商负责人91', '测试供应商联系电话91', '测试供应商邮箱91', '测试供应商地址91', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 0);
INSERT INTO `supplier` VALUES (93, '测试供应商名称92', '测试供应商负责人92', '测试供应商联系电话92', '测试供应商邮箱92', '测试供应商地址92', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 1);
INSERT INTO `supplier` VALUES (94, '测试供应商名称93', '测试供应商负责人93', '测试供应商联系电话93', '测试供应商邮箱93', '测试供应商地址93', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 0);
INSERT INTO `supplier` VALUES (95, '测试供应商名称94', '测试供应商负责人94', '测试供应商联系电话94', '测试供应商邮箱94', '测试供应商地址94', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 1);
INSERT INTO `supplier` VALUES (96, '测试供应商名称95', '测试供应商负责人95', '测试供应商联系电话95', '测试供应商邮箱95', '测试供应商地址95', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 0);
INSERT INTO `supplier` VALUES (97, '测试供应商名称96', '测试供应商负责人96', '测试供应商联系电话96', '测试供应商邮箱96', '测试供应商地址96', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 1);
INSERT INTO `supplier` VALUES (98, '测试供应商名称97', '测试供应商负责人97', '测试供应商联系电话97', '测试供应商邮箱97', '测试供应商地址97', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 0);
INSERT INTO `supplier` VALUES (99, '测试供应商名称98', '测试供应商负责人98', '测试供应商联系电话98', '测试供应商邮箱98', '测试供应商地址98', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 1);
INSERT INTO `supplier` VALUES (100, '测试供应商名称99', '测试供应商负责人99', '测试供应商联系电话99', '测试供应商邮箱99', '测试供应商地址99', '2022-09-18 21:26:09', '2022-09-18 21:26:09', 0);
COMMIT;

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `USER_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '用户ID,主键自增',
  `USER_NAME` varchar(20) NOT NULL COMMENT '用户名',
  `USER_TEL` varchar(20) NOT NULL COMMENT '联系电话',
  `USER_EMAIL` varchar(100) NOT NULL COMMENT '邮箱',
  `USER_NICK` varchar(10) DEFAULT 'WMS' COMMENT '用户昵称',
  `PASSWORD` varchar(255) NOT NULL COMMENT '密码',
  `SALT` varchar(100) DEFAULT NULL COMMENT '盐值',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`USER_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=101 DEFAULT CHARSET=utf8 COMMENT='用户表';

-- ----------------------------
-- Records of user
-- ----------------------------
BEGIN;
INSERT INTO `user` VALUES (1, '测试名称0', '1888888880', '1@10.com', '测试昵称0', '0测试密码0', '测试盐0', '2022-09-17 22:48:42', '2022-09-17 22:48:42', 0);
INSERT INTO `user` VALUES (2, '测试名称1', '1888888881', '1@11.com', '测试昵称1', '1测试密码1', '测试盐1', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 1);
INSERT INTO `user` VALUES (3, '测试名称2', '1888888882', '1@12.com', '测试昵称2', '2测试密码2', '测试盐2', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 0);
INSERT INTO `user` VALUES (4, '测试名称3', '1888888883', '1@13.com', '测试昵称3', '3测试密码3', '测试盐3', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 1);
INSERT INTO `user` VALUES (5, '测试名称4', '1888888884', '1@14.com', '测试昵称4', '4测试密码4', '测试盐4', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 0);
INSERT INTO `user` VALUES (6, '测试名称5', '1888888885', '1@15.com', '测试昵称5', '5测试密码5', '测试盐5', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 1);
INSERT INTO `user` VALUES (7, '测试名称6', '1888888886', '1@16.com', '测试昵称6', '6测试密码6', '测试盐6', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 0);
INSERT INTO `user` VALUES (8, '测试名称7', '1888888887', '1@17.com', '测试昵称7', '7测试密码7', '测试盐7', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 1);
INSERT INTO `user` VALUES (9, '测试名称8', '1888888888', '1@18.com', '测试昵称8', '8测试密码8', '测试盐8', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 0);
INSERT INTO `user` VALUES (10, '测试名称9', '1888888889', '1@19.com', '测试昵称9', '9测试密码9', '测试盐9', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 1);
INSERT INTO `user` VALUES (11, '测试名称10', '18888888810', '1@110.com', '测试昵称10', '10测试密码10', '测试盐10', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 0);
INSERT INTO `user` VALUES (12, '测试名称11', '18888888811', '1@111.com', '测试昵称11', '11测试密码11', '测试盐11', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 1);
INSERT INTO `user` VALUES (13, '测试名称12', '18888888812', '1@112.com', '测试昵称12', '12测试密码12', '测试盐12', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 0);
INSERT INTO `user` VALUES (14, '测试名称13', '18888888813', '1@113.com', '测试昵称13', '13测试密码13', '测试盐13', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 1);
INSERT INTO `user` VALUES (15, '测试名称14', '18888888814', '1@114.com', '测试昵称14', '14测试密码14', '测试盐14', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 0);
INSERT INTO `user` VALUES (16, '测试名称15', '18888888815', '1@115.com', '测试昵称15', '15测试密码15', '测试盐15', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 1);
INSERT INTO `user` VALUES (17, '测试名称16', '18888888816', '1@116.com', '测试昵称16', '16测试密码16', '测试盐16', '2022-09-17 22:48:43', '2022-09-17 22:48:42', 0);
INSERT INTO `user` VALUES (18, '测试名称17', '18888888817', '1@117.com', '测试昵称17', '17测试密码17', '测试盐17', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (19, '测试名称18', '18888888818', '1@118.com', '测试昵称18', '18测试密码18', '测试盐18', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (20, '测试名称19', '18888888819', '1@119.com', '测试昵称19', '19测试密码19', '测试盐19', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (21, '测试名称20', '18888888820', '1@120.com', '测试昵称20', '20测试密码20', '测试盐20', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (22, '测试名称21', '18888888821', '1@121.com', '测试昵称21', '21测试密码21', '测试盐21', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (23, '测试名称22', '18888888822', '1@122.com', '测试昵称22', '22测试密码22', '测试盐22', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (24, '测试名称23', '18888888823', '1@123.com', '测试昵称23', '23测试密码23', '测试盐23', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (25, '测试名称24', '18888888824', '1@124.com', '测试昵称24', '24测试密码24', '测试盐24', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (26, '测试名称25', '18888888825', '1@125.com', '测试昵称25', '25测试密码25', '测试盐25', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (27, '测试名称26', '18888888826', '1@126.com', '测试昵称26', '26测试密码26', '测试盐26', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (28, '测试名称27', '18888888827', '1@127.com', '测试昵称27', '27测试密码27', '测试盐27', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (29, '测试名称28', '18888888828', '1@128.com', '测试昵称28', '28测试密码28', '测试盐28', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (30, '测试名称29', '18888888829', '1@129.com', '测试昵称29', '29测试密码29', '测试盐29', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (31, '测试名称30', '18888888830', '1@130.com', '测试昵称30', '30测试密码30', '测试盐30', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (32, '测试名称31', '18888888831', '1@131.com', '测试昵称31', '31测试密码31', '测试盐31', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (33, '测试名称32', '18888888832', '1@132.com', '测试昵称32', '32测试密码32', '测试盐32', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (34, '测试名称33', '18888888833', '1@133.com', '测试昵称33', '33测试密码33', '测试盐33', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (35, '测试名称34', '18888888834', '1@134.com', '测试昵称34', '34测试密码34', '测试盐34', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (36, '测试名称35', '18888888835', '1@135.com', '测试昵称35', '35测试密码35', '测试盐35', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (37, '测试名称36', '18888888836', '1@136.com', '测试昵称36', '36测试密码36', '测试盐36', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (38, '测试名称37', '18888888837', '1@137.com', '测试昵称37', '37测试密码37', '测试盐37', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (39, '测试名称38', '18888888838', '1@138.com', '测试昵称38', '38测试密码38', '测试盐38', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (40, '测试名称39', '18888888839', '1@139.com', '测试昵称39', '39测试密码39', '测试盐39', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (41, '测试名称40', '18888888840', '1@140.com', '测试昵称40', '40测试密码40', '测试盐40', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (42, '测试名称41', '18888888841', '1@141.com', '测试昵称41', '41测试密码41', '测试盐41', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (43, '测试名称42', '18888888842', '1@142.com', '测试昵称42', '42测试密码42', '测试盐42', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (44, '测试名称43', '18888888843', '1@143.com', '测试昵称43', '43测试密码43', '测试盐43', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (45, '测试名称44', '18888888844', '1@144.com', '测试昵称44', '44测试密码44', '测试盐44', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (46, '测试名称45', '18888888845', '1@145.com', '测试昵称45', '45测试密码45', '测试盐45', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (47, '测试名称46', '18888888846', '1@146.com', '测试昵称46', '46测试密码46', '测试盐46', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (48, '测试名称47', '18888888847', '1@147.com', '测试昵称47', '47测试密码47', '测试盐47', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (49, '测试名称48', '18888888848', '1@148.com', '测试昵称48', '48测试密码48', '测试盐48', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (50, '测试名称49', '18888888849', '1@149.com', '测试昵称49', '49测试密码49', '测试盐49', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (51, '测试名称50', '18888888850', '1@150.com', '测试昵称50', '50测试密码50', '测试盐50', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (52, '测试名称51', '18888888851', '1@151.com', '测试昵称51', '51测试密码51', '测试盐51', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (53, '测试名称52', '18888888852', '1@152.com', '测试昵称52', '52测试密码52', '测试盐52', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (54, '测试名称53', '18888888853', '1@153.com', '测试昵称53', '53测试密码53', '测试盐53', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (55, '测试名称54', '18888888854', '1@154.com', '测试昵称54', '54测试密码54', '测试盐54', '2022-09-17 22:48:43', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (56, '测试名称55', '18888888855', '1@155.com', '测试昵称55', '55测试密码55', '测试盐55', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (57, '测试名称56', '18888888856', '1@156.com', '测试昵称56', '56测试密码56', '测试盐56', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (58, '测试名称57', '18888888857', '1@157.com', '测试昵称57', '57测试密码57', '测试盐57', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (59, '测试名称58', '18888888858', '1@158.com', '测试昵称58', '58测试密码58', '测试盐58', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (60, '测试名称59', '18888888859', '1@159.com', '测试昵称59', '59测试密码59', '测试盐59', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (61, '测试名称60', '18888888860', '1@160.com', '测试昵称60', '60测试密码60', '测试盐60', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (62, '测试名称61', '18888888861', '1@161.com', '测试昵称61', '61测试密码61', '测试盐61', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (63, '测试名称62', '18888888862', '1@162.com', '测试昵称62', '62测试密码62', '测试盐62', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (64, '测试名称63', '18888888863', '1@163.com', '测试昵称63', '63测试密码63', '测试盐63', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (65, '测试名称64', '18888888864', '1@164.com', '测试昵称64', '64测试密码64', '测试盐64', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (66, '测试名称65', '18888888865', '1@165.com', '测试昵称65', '65测试密码65', '测试盐65', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (67, '测试名称66', '18888888866', '1@166.com', '测试昵称66', '66测试密码66', '测试盐66', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (68, '测试名称67', '18888888867', '1@167.com', '测试昵称67', '67测试密码67', '测试盐67', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (69, '测试名称68', '18888888868', '1@168.com', '测试昵称68', '68测试密码68', '测试盐68', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (70, '测试名称69', '18888888869', '1@169.com', '测试昵称69', '69测试密码69', '测试盐69', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (71, '测试名称70', '18888888870', '1@170.com', '测试昵称70', '70测试密码70', '测试盐70', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (72, '测试名称71', '18888888871', '1@171.com', '测试昵称71', '71测试密码71', '测试盐71', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (73, '测试名称72', '18888888872', '1@172.com', '测试昵称72', '72测试密码72', '测试盐72', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (74, '测试名称73', '18888888873', '1@173.com', '测试昵称73', '73测试密码73', '测试盐73', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (75, '测试名称74', '18888888874', '1@174.com', '测试昵称74', '74测试密码74', '测试盐74', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (76, '测试名称75', '18888888875', '1@175.com', '测试昵称75', '75测试密码75', '测试盐75', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (77, '测试名称76', '18888888876', '1@176.com', '测试昵称76', '76测试密码76', '测试盐76', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (78, '测试名称77', '18888888877', '1@177.com', '测试昵称77', '77测试密码77', '测试盐77', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (79, '测试名称78', '18888888878', '1@178.com', '测试昵称78', '78测试密码78', '测试盐78', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (80, '测试名称79', '18888888879', '1@179.com', '测试昵称79', '79测试密码79', '测试盐79', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (81, '测试名称80', '18888888880', '1@180.com', '测试昵称80', '80测试密码80', '测试盐80', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (82, '测试名称81', '18888888881', '1@181.com', '测试昵称81', '81测试密码81', '测试盐81', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (83, '测试名称82', '18888888882', '1@182.com', '测试昵称82', '82测试密码82', '测试盐82', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (84, '测试名称83', '18888888883', '1@183.com', '测试昵称83', '83测试密码83', '测试盐83', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (85, '测试名称84', '18888888884', '1@184.com', '测试昵称84', '84测试密码84', '测试盐84', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (86, '测试名称85', '18888888885', '1@185.com', '测试昵称85', '85测试密码85', '测试盐85', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (87, '测试名称86', '18888888886', '1@186.com', '测试昵称86', '86测试密码86', '测试盐86', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (88, '测试名称87', '18888888887', '1@187.com', '测试昵称87', '87测试密码87', '测试盐87', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (89, '测试名称88', '18888888888', '1@188.com', '测试昵称88', '88测试密码88', '测试盐88', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (90, '测试名称89', '18888888889', '1@189.com', '测试昵称89', '89测试密码89', '测试盐89', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (91, '测试名称90', '18888888890', '1@190.com', '测试昵称90', '90测试密码90', '测试盐90', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 0);
INSERT INTO `user` VALUES (92, '测试名称91', '18888888891', '1@191.com', '测试昵称91', '91测试密码91', '测试盐91', '2022-09-17 22:48:44', '2022-09-17 22:48:43', 1);
INSERT INTO `user` VALUES (93, '测试名称92', '18888888892', '1@192.com', '测试昵称92', '92测试密码92', '测试盐92', '2022-09-17 22:48:44', '2022-09-17 22:48:44', 0);
INSERT INTO `user` VALUES (94, '测试名称93', '18888888893', '1@193.com', '测试昵称93', '93测试密码93', '测试盐93', '2022-09-17 22:48:44', '2022-09-17 22:48:44', 1);
INSERT INTO `user` VALUES (95, '测试名称94', '18888888894', '1@194.com', '测试昵称94', '94测试密码94', '测试盐94', '2022-09-17 22:48:44', '2022-09-17 22:48:44', 0);
INSERT INTO `user` VALUES (96, '测试名称95', '18888888895', '1@195.com', '测试昵称95', '95测试密码95', '测试盐95', '2022-09-17 22:48:44', '2022-09-17 22:48:44', 1);
INSERT INTO `user` VALUES (97, '测试名称96', '18888888896', '1@196.com', '测试昵称96', '96测试密码96', '测试盐96', '2022-09-17 22:48:44', '2022-09-17 22:48:44', 0);
INSERT INTO `user` VALUES (98, '测试名称97', '18888888897', '1@197.com', '测试昵称97', '97测试密码97', '测试盐97', '2022-09-17 22:48:44', '2022-09-17 22:48:44', 1);
INSERT INTO `user` VALUES (99, '测试名称98', '18888888898', '1@198.com', '测试昵称98', '98测试密码98', '测试盐98', '2022-09-17 22:48:44', '2022-09-17 22:48:44', 0);
INSERT INTO `user` VALUES (100, '测试名称99', '18888888899', '1@199.com', '测试昵称99', '99测试密码99', '测试盐99', '2022-09-17 22:48:44', '2022-09-17 22:48:44', 1);
COMMIT;

-- ----------------------------
-- Table structure for user_department
-- ----------------------------
DROP TABLE IF EXISTS `user_department`;
CREATE TABLE `user_department` (
  `USER_ID` int(11) NOT NULL COMMENT '用户ID,关联用户表主键',
  `DEPT_ID` int(11) NOT NULL COMMENT '部门ID,关联部门表主键,需要关联最末级节点',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`USER_ID`,`DEPT_ID`),
  KEY `DEPT_ID` (`DEPT_ID`),
  CONSTRAINT `user_department_ibfk_1` FOREIGN KEY (`USER_ID`) REFERENCES `user` (`USER_ID`),
  CONSTRAINT `user_department_ibfk_2` FOREIGN KEY (`DEPT_ID`) REFERENCES `department` (`DEPT_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='用户部门关联表';

-- ----------------------------
-- Records of user_department
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for user_role
-- ----------------------------
DROP TABLE IF EXISTS `user_role`;
CREATE TABLE `user_role` (
  `USER_ID` int(11) NOT NULL COMMENT '用户ID,关联用户表主键',
  `ROLE_ID` int(11) NOT NULL COMMENT '角色ID,关联角色表主键',
  `CREATE_TIME` datetime DEFAULT NULL COMMENT '创建时间',
  `UPDATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '设置当前时间，并且自动更更新时间',
  `IS_DELETE` int(11) DEFAULT '1' COMMENT '是否删除 0:删除 1:未删除',
  PRIMARY KEY (`USER_ID`,`ROLE_ID`),
  KEY `ROLE_ID` (`ROLE_ID`),
  CONSTRAINT `user_role_ibfk_1` FOREIGN KEY (`USER_ID`) REFERENCES `user` (`USER_ID`),
  CONSTRAINT `user_role_ibfk_2` FOREIGN KEY (`ROLE_ID`) REFERENCES `role` (`ROLE_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='用户角色关联表';

-- ----------------------------
-- Records of user_role
-- ----------------------------
BEGIN;
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
